In [3]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

 ········

In [7]:
# 1. Establish a connection between Python and the Sakila database.
sd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+sd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [103]:
# 2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame.
# The function should take in three parameters:
# `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
# `month`: an integer representing the month for which rental data is to be retrieved.
# `year`: an integer representing the year for which rental data is to be retrieved.
# The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database,
# and return it as a pandas DataFrame.

from sqlalchemy import text

def rentals_month(month, year):
    with engine.connect() as connection:
        txt = f'''select rental_date, rental_id, inventory_id, customer_id, staff_id
            from rental 
            where MONTHNAME(rental_date) = :month AND YEAR(rental_date) = :year
            order by rental_date;'''
        query = text(txt)
        result = connection.execute(query, {"month": month, "year": year})
        return pd.DataFrame(result.all())

In [105]:
rentals_month("May", 2005)

             rental_date  rental_id  inventory_id  customer_id  staff_id
0    2005-05-24 22:53:30          1           367          130         1
1    2005-05-24 22:54:33          2          1525          459         1
2    2005-05-24 23:03:39          3          1711          408         1
3    2005-05-24 23:04:41          4          2452          333         2
4    2005-05-24 23:05:21          5          2079          222         1
...                  ...        ...           ...          ...       ...
1151 2005-05-31 21:36:44       1153          2725          506         2
1152 2005-05-31 21:42:09       1154          2732           59         1
1153 2005-05-31 22:17:11       1155          2048          251         2
1154 2005-05-31 22:37:34       1156           460          106         2
1155 2005-05-31 22:47:45       1157          1449           61         1

[1156 rows x 5 columns]

In [107]:
rentals_month = rentals_month("May", 2005)
rentals_month

             rental_date  rental_id  inventory_id  customer_id  staff_id
0    2005-05-24 22:53:30          1           367          130         1
1    2005-05-24 22:54:33          2          1525          459         1
2    2005-05-24 23:03:39          3          1711          408         1
3    2005-05-24 23:04:41          4          2452          333         2
4    2005-05-24 23:05:21          5          2079          222         1
...                  ...        ...           ...          ...       ...
1151 2005-05-31 21:36:44       1153          2725          506         2
1152 2005-05-31 21:42:09       1154          2732           59         1
1153 2005-05-31 22:17:11       1155          2048          251         2
1154 2005-05-31 22:37:34       1156           460          106         2
1155 2005-05-31 22:47:45       1157          1449           61         1

[1156 rows x 5 columns]

In [109]:
# 3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input
# along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 
# The function should also include the month and year as parameters and use them to name the new column according to the month and year, 
# for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".
# *Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

def rental_count_month(month, year, rentals_month):
    with engine.connect(rentals_month) as connection:
        txt = f'''select rental_date, customer_id, COUNT(rental_id) as "rentals_<month>_<year>"
            from rental
            where MONTHNAME(rental_date) = :month AND YEAR(rental_date) = :year
            group by customer_id
            order by rental_date;'''
        query = text(txt)
        result2 = connection.execute(query, {"month": month, "year": year})
        return pd.DataFrame(result2.all())

In [111]:
# 3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input
# along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 
# The function should also include the month and year as parameters and use them to name the new column according to the month and year, 
# for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".
# *Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

def rental_count_month(month, year, rentals_month):
    # Convert month to two-digit format
    month_str = str(month).zfill(2)  # Ensures "05" instead of "5"

    # Group by customer_id and count rentals
    rental_counts = rentals_month.groupby("customer_id")["rental_id"].count().reset_index()

    # Rename the count column dynamically
    column_name = f"rentals_{month_str}_{year}"
    rental_counts.rename(columns={"rental_id": column_name}, inplace=True)

    return rental_counts

In [113]:
rental_counts = rental_count_month(5, 2005, rentals_month)
rental_counts

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [115]:
# 4. Create a Python function called `compare_rentals` that takes two DataFrames as input
# containing the number of rentals made by each customer in different months and years. 
# The function should return a combined DataFrame with a new 'difference' column, 
# which is the difference between the number of rentals in the two months.

def compare_rentals(nr_rentals_1, nr_rentals_2):
    # Get column names for rentals from both DataFrames
    col1 = nr_rentals_1.columns[1]  # Rental count column in nr_rentals_1
    col2 = nr_rentals_2.columns[1]  # Rental count column in nr_rentals_2

    # Merge DataFrames on customer_id with outer join to include all customers
    merged_rentals = pd.merge(nr_rentals_1, nr_rentals_2, on="customer_id", how="outer")

    # Fill NaN values with 0 - important for cases where a customer is only in one of the months
    merged_rentals.fillna(0, inplace=True)

    # Create a new "difference" column
    merged_rentals["difference"] = merged_rentals[col2] - merged_rentals[col1]

    return merged_rentals

In [117]:
# Get rental counts for two different months
nr_rentals_1 = rental_count_month(5, 2005, rentals_month)
nr_rentals_2 = rental_count_month(6, 2005, rentals_month)

# Compare rentals between May and June 2005
merged_rentals = compare_rentals(nr_rentals_1, nr_rentals_2)

print(merged_rentals)

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1                2                2           0
1              2                1                1           0
2              3                2                2           0
3              5                3                3           0
4              6                3                3           0
..           ...              ...              ...         ...
515          594                4                4           0
516          595                1                1           0
517          596                6                6           0
518          597                2                2           0
519          599                1                1           0

[520 rows x 4 columns]